 {
   "arcaneStudy": {
     "name": "Магічна Дослідницька",
     "description": "Спокійне, просякнуте магічною енергією місце, де тиша ділиться таємницями магії. Її стіни вкриті стародавніми рунами, що світяться м’яким світлом, а повітря наповнене запахом чорнил, пергаменту та озону. Тут маги і вчені проводять ночі над книгами, виготовляють фокуси, записують знання та досліджують магічні предмети. Але найбільш знана студія завдяки благословенню бастіону — кожному, хто відпочине тут, відкривається крихта містичного розуміння, що дозволяє розгадувати приховане без жодної ціни.",
     "cost": 2000,
     "growth": 10,
     "requirements": ["library"],
     "requiredPopulation": 500
   },
   "armory": {
     "name": "Зброярня",
     "description": "Це важка, масивна будівля з товстими дерев’яними дверима й кам’яною підлогою, що пахне маслом, металом і потом. Уздовж стін стоять манекени в броні, щити висять на гачках, а зброя — від коротких мечів до арбалетів — акуратно розкладена на стелажах. Тут лунає брязкіт сталі, скрегіт точильного круга й глухі удари молота. Зброярня є серцем обороноздатності острову, бо саме тут готуються до битв.",
     "cost": 1200,
     "growth": 0,
     "requirements": ["barracks"]
   },
   "barracks": {
     "name": "Казарми",
     "description": "Прості, але міцні, казарми стоять поблизу укріплень острову. Усередині — ряди двоповерхових ліжок, скрині для особистих речей та вицвілі прапори, що нагадують про давні битви. Повітря сповнене запахом поту, диму та старого дерева. Це місце не про комфорт — це дім тих, хто готовий померти за безпеку острову. Саме тут формуються братство, дисципліна та лояльність.",
     "cost": 1500,
     "growth": 12,
     "requirements": ["stonecutter"],
     "requiredPopulation": 100
   },
   "farm": {
     "name": "Ферма",
     "description": "Ферма лежить трохи осторонь від головної дороги острову — ряди грядок, пугало, хрюкання ситих свиней і аромат диму з дров’яної печі. Тут працюють зморені, але доброзичливі люди, що дбайливо вирощують врожай і готують легендарні свинячі котлети. Хоч ця їжа й не вишукана, вона насичує, зігріває й дає силу навіть найстомленішим мандрівникам. У народі кажуть: «З котлетами з ферми — навіть богів не страшно будити».",
     "cost": 800,
     "growth": 50,
     "requirements": []
   },
   "garden": {
     "name": "Сад",
     "description": "Сади  — це місця спокою, аромату і ретельної праці. Деякі з них цвітуть барвистими квітами, інші приховують між листям рідкісні трави або отруйні гриби. Дощова вода стікає в кам’яні жолоби, а робітники ретельно доглядають кожну ділянку. Сад — це не лише окраса, а й джерело ресурсів: харчів, ліків, отрут або вишуканих дарунків. Тут народжується краса і користь, а іноді й смерть.",
     "cost": 600,
     "growth": 20,
     "requirements": []
   },
   "harbor": {
     "name": "Гавань та Порт",
     "description": "Порт та гавань — це живе серце острову, де хвилі б’ються об причали, а чайки кричать над щоглами кораблів. Тут моряки снують між корабельними трюмами, вантажники розвантажують баржі, а капітани торгуються з агентами. Дерев’яні пірси тягнуться у воду, приносячи багатства з далеких берегів і відправляючи героїв у невідомість. Гавань — це ворота до решти світу.",
     "cost": 1000,
     "growth": 30,
     "bonus": "Збільшує відсоток моряків з приросту населення на 5%.",
     "requirements": ["stonecutter", "sawmill", "lighthouse", "pirs"],
     "requiredPopulation": 200
   },
   "houses": {
     "name": "Домівки",
     "description": "Острівні домівки  — це перші стіни, що зберігають тепло від вітру. Простенькі дерев’яні або кам’яні хатини з солом’яними дахами чи глиняною черепицею утворюють вулички, наповнені життям. З димоходів підіймається дим, на вікнах — вицвілі завіси, а в садках граються діти. Тут селяться ремісники, охоронці, сім’ї та мандрівники. З цього починається громада.",
     "cost": 900,
     "growth": 80,
     "requirements": []
   },
   "library": {
     "name": "Бібліотека",
     "description": "Тиха й велична бібліотека стоїть осторонь острівного шуму й гаму. Її стіни встелені книжковими полицями — від підлоги до стелі. Тут пахне старим пергаментом, воском і пилом. Писарі занотовують хроніки, мандрівники зберігають легенди, а маги вивчають забуті заклинання. У лампадному світлі зберігаються знання минулого — й ключі до майбутнього.",
     "cost": 1500,
     "growth": 5,
     "requirements": []
   },
   "lighthouse": {
     "name": "Маяк",
     "description": "Маяк здіймається над береговими скелями бастіону, мов палаючий факел цивілізації серед дикого моря. Його вогонь видно за багато миль, і навіть найзапекліші шторми не можуть приховати це світло. У його стінах живе сторож — мовчазний, пильний, вірний. Для моряків цей маяк — не просто вежа, а обіцянка порятунку, дороговказ додому.",
     "cost": 700,
     "growth": 20,
     "requirements": ["stonecutter"]
   },
   "mill": {
     "name": "Млин",
     "description": "Млин поволі обертає свої великі лопаті, що скриплять у ритмі вітру чи плину води. Усередині — аромат свіжозмеленої пшениці, хмара борошна в повітрі та робітники з запорошеними руками. Тут зерно перетворюється на білу муку, а мука — на запашний хліб. Серед простих мешканців млин вважається благословенням, а для мандрівників — джерелом життєдайної сили.",
     "cost": 1100,
     "growth": 50,
     "requirements": ["farm", "stonecutter"]
   },
   "pirs": {
     "name": "Пірс",
     "description": "Простий дерев’яний настил, що простягається в море, пірс здається незначним — але саме звідси починаються великі подорожі. Тут скриплять канати, плескаються хвилі, а човни м’яко погойдуються, прив’язані до стовпців. Рибалки кидають сіті, розвідники вирушають у розвідку, а герої — до нових берегів. Це точка зв’язку між островом і навколишнім світом.",
     "cost": 500,
     "growth": 10,
     "requirements": []
   },
   "portCrane": {
     "name": "Портовий кран",
     "description": "TBD",
     "cost": 1200,
     "growth": 0,
     "requirements": ["stonecutter", "sawmill", "lighthouse"]
   },
   "sanctuary": {
     "name": "Капличка",
     "description": "У скромній капличці панує тиша, порушувана лише шепотом молитв і потріскуванням свічок. На стінах — ікони богів, тотеми природи чи древні символи віри. Тут кожен може знайти спокій, звернутися до вищих сил або просто пригадати, заради чого він бореться. Капличка — це не храм помпезності, а притулок душі.",
     "cost": 1800,
     "growth": 25,
     "requirements": ["sawmill"],
     "requiredPopulation": 300
   },
   "sawmill": {
     "name": "Лісопильня",
     "description": "Глухий стукіт лез, запах свіжоскошеної деревини та тирса в повітрі — лісопильня  ніколи не спить. Тут зранку до ночі працюють пилки, розрізаючи колоди на дошки, з яких зводять будівлі, лагодять кораблі й створюють інструменти. Це місце — рушій сили розвитку, невидимий кістяк більшості споруд в поселенні.",
     "cost": 1000,
     "growth": 5,
     "requirements": [],
     "requiredPopulation": 100
   },
   "shipyardSmall": {
     "name": "Верф",
     "description": "Над прибережною лінією здіймається дерев’яна конструкція, обрамлена підйомними кранами, риштуваннями та канатами. Тут теслі працюють над корпусами кораблів, оббиваючи борти смолою й лагодячи вітрила. Маленька, але жвава — ця верф завжди в русі: одні кораблі заходять на ремонт, інші — спускаються на воду.",
     "cost": 3500,
     "growth": 100,
     "bonus": "Збільшує відсоток моряків з приросту населення на 5%.",
     "requirements": ["stonecutter", "sawmill", "lighthouse", "portCrane", "harbor"]
   },
   "stonecutter": {
     "name": "Каменярня",
     "description": "У підніжжі скелястого пагорба працюють відбійні молотки, ламаються брили, і чутно глухі удари кайла. Каменярня — це місце сили й поту, де витягують сировину з надр землі. Тут народжуються стіни острівного бастіону, фундаменти храмів і ядра для катапульт. Без каменю — не буде міцності, а без майстрів — не буде фортеці.",
     "cost": 1000,
     "growth": 5,
     "requirements": [],
     "requiredPopulation": 100
   },
   "storehouse": {
     "name": "Склад",
     "description": "Темне, прохолодне приміщення з товстими кам’яними стінами та великими дверима, сховище пахне деревом, прянощами й старими тканинами. Тут зберігаються мішки з борошном, бочки з рідиною, згортки з хутром і ящики з цінностями. Робітники працюють в тиші, ведучи облік кожного предмета. Це серце внутрішньої торгівлі острову — тут починається багатство і тут воно консервується.",
     "cost": 800,
     "growth": 0,
     "requirements": []
   },
   "tavern": {
     "name": "Таверна",
     "description": "Центральне місце острову.",
     "cost": 0,
     "growth": 0,
     "requirements": []
   },
   "townhouse": {
     "name": "Ратуша",
     "description": "Велична та поважна, ратуша стоїть у самому центрі острову. Її зали — це місце зборів, дебатів і важливих рішень. Тут проводяться ради громади, приймаються гості, видаються накази й записуються хроніки поселення. Ратуша — це не просто адміністративна споруда, а символ єдності, порядку й волі мешканців острова.",
     "cost": 2500,
     "growth": 90,
     "requirements": ["barracks", "sawmill", "stonecutter", "tavern"],
     "requiredPopulation": 500
   },
   "workshop": {
     "name": "Майстерня",
     "description": "Це світ запаху дерева, металу й фарби, де звуки молота й пилки сплітаються в симфонію творення. Полички завалені інструментами, кресленнями та недобудованими проєктами. Тут народжуються обладунки, картини, магічні амулети й шедеври рук людських. Це місце для майстрів, винахідників, митців і мрійників, що перетворюють ідеї на реальність.",
     "cost": 1000,
     "growth": 10,
     "requirements": ["sawmill"]
   }
 }
